{
  "about": [
    "I enjoy creating minimalistic digital products that enhance everyday life. I thrive at the intersection of product design and implementation, where I feel most at home. Problem-solving comes naturally to me, whether it involves zooming in to address intricate details or zooming out to maintain a holistic perspective. I stay focused on the needs of both users and stakeholders, ensuring that solutions are practical, impactful, and user-centered.",
    "After leaving high school at 18, I began working in administrative roles. As a late bloomer with abundant creativity and a strong, intuitive streak, I often felt out of place in the traditional education system. However, everything changed when I was introduced to computers—I was instantly hooked. I began teaching myself programming and eventually transitioned into professional roles where I used languages such as C, C++, Java, PHP, Objective-C, Swift, and more. These languages were part of my daily work, spanning platforms like Windows, Linux, macOS, and iOS.",
    "Even after 27 years, my work still feels like a passion rather than a job. You’ll often find me behind my desk, creating and exploring new ideas or delving into adjacent fields like design and 3D software. When I want to disconnect, I turn to movies, series, or drawing on paper with colored pencils or on iPad."
  ],
  "positions": [
    {
      "title": "Apple Designer/Developer",
      "company": "Independent",
      "location": "Almere",
      "sectors": ["Graphics & Design", "Development"],
      "start": "202408",
      "end": "?",
      "description": "During this period, I explored a variety of ideas and concepts while challenging myself technically. I experimented with extending applications using scripting frameworks, pure JavaScript, Python, and implemented a SwiftUI-backed React reconciler. I also released a macOS app called Patani for creating patterns and developed an offline journaling app for iOS, which I ultimately chose not to release.",
      "keywords": ["macOS","iOS","Swift","SwiftUI","AppKit","UIKit","Git","JS","HTML","CSS","React","Python","SQLite"]
    },
    {
      "title": "Senior Engineer",
      "company": "Storio Group",
      "location": "Amsterdam",
      "sectors": ["Personalized Consumer Goods","E-commerce"],
      "start": "202208",
      "end": "202407",
      "description": "As part of a two-developer team, I was responsible for maintaining and implementing new features in a complex macOS application, working with a vast and intricate codebase that leveraged numerous internal frameworks. Our work spanned multiple vendors and brands, both within and outside the App Store, requiring significant operational management. Notable projects included developing an internal web server for seamless mobile uploads and integrating Google Photos. While the role provided stability, I ultimately decided to pursue new opportunities that aligned more closely with my passion for innovation and creativity.",
      "keywords": ["macOS","Swift","SwiftUI","AppKit","Git","JS","HTML","CSS","Google Photos"]
    },
    {
      "title": "Full Stack Developer",
      "company": "MakeSense Health",
      "location": "Amsterdam",
      "sectors": ["Healthcare","Creative"],
      "start": "202106",
      "end": "202201",
      "description": "Developed various proof-of-concept iOS, macOS, and web applications, powered by self-designed backends running on Node.js. I valued the creative freedom in exploring diverse concepts, but working as the sole developer in a fully remote environment felt isolating. Seeking collaboration and teamwork, I decided to transition to roles that align more closely with my preference for building alongside others.",
      "keywords": ["iOS","macOS","Swift","SwiftUI","UIKit","Mac Catalyst","UDP","Bonjour","Git","Lit","JS","HTML","CSS","NodeJS","Firebase","CloudFlare Workers","Vercel","PostgreSQL","Contenful","Wordpress","Framer","Figma","Blender3D","Heroku","AWS"]
    },
    {
      "title": "iOS Developer",
      "company": "Tiqets",
      "location": "Amsterdam",
      "sectors": ["Tourism","E-commerce"],
      "start": "201712",
      "end": "202104",
      "description": "Maintained and enhanced a native iOS e-commerce application built with Swift, delivering features and improvements in bi-weekly Scrum sprints. Despite the mobile team's pivotal role, it was often undervalued within the company, leading to challenges such as high turnover. The impact of COVID-19 hit both the tourism industry and the organization hard, and after a year, I decided to seek opportunities that would allow for continued growth and learning.",
      "keywords": ["iOS","Swift","UIKit","BFF","Git","Amplitude","Looker","Firebase","Adyen","Freshdesk","Leanplum","CoreLocation","Scrum"]
    },
    {
      "title": "iOS Developer",
      "company": "Capture Camera",
      "location": "Amsterdam",
      "sectors": ["Consumer"],
      "start": "201608",
      "end": "201705",
      "description": "Led the development, enhancement, and maintenance of the company’s native iOS app, built with Swift. As the startup’s first employee, I enjoyed the unique opportunity to help shape the product and company culture. Unfortunately, a personal tragedy involving a key investor prevented our Series B funding from materializing, and the company was forced to close its doors.",
      "keywords": ["iOS","Swift","REST","Git","CoreLocation","CoreData","CoreImage","Scrum"]
    },
    {
      "title": "iOS Developer",
      "company": "Treatwell",
      "location": "Amsterdam",
      "sectors": ["Hair & Beauty","E-commerce"],
      "start": "201503",
      "end": "201607",
      "description": "Responsible for maintenance of the company’s native iOS E-commerce app, built using Objective-C. In parallel a brand we started a new version of the app using Swift in cooperation with fellow developers in Vilnius, Lithuania. We were acquired by a competitor and we had to downsize, hence my decision to move on.",
      "keywords": ["iOS","Swift","JSON","Git","Objective-C","CoreLocation","Adyen","Scrum"]
    },
    {
      "title": "iOS Developer",
      "company": "TravelBird",
      "location": "Amsterdam",
      "sectors": ["Tourism","E-commerce"],
      "start": "201306",
      "end": "201503",
      "description": "Co-responsible for development and maintenance of the company’s native iOS app, built using Objective-C. This was my first stretch being a mobile developer. It was for the whole team and we had a lot of fun breaking ground and figuring things out together.",
      "keywords": ["iOS","Objective-C","JSON","Git","Scrum","Adyen","CoreData"]
    },
    {
      "title": "Software Developer",
      "company": "EnzoSystems",
      "location": "Almere",
      "sectors": ["Hospitality"],
      "start": "201207",
      "end": "201210",
      "description": "Improved an in-house developed Windows touchscreen based desktop shell, built using Qt/C++",
      "keywords": ["Windows","C","C++","Qt4"]
    },
    {
      "title": "Software Developer",
      "company": "IJsfontein",
      "location": "Amsterdam",
      "sectors": ["Serious Games"],
      "start": "201101",
      "end": "201202",
      "description": "Responsible for development of touchscreen based software for a room filling installation for Paleis Het Loo, built using Qt/C++. Also worked on a mobile web application for Naturalis, built using HTML/CSS/JS, and the company website using Wordpress.",
      "keywords": ["Windows","C++","Qt4","HTML","CSS","JS","jQuery","WordPress"]
    },
    {
      "title": "Software Developer",
      "company": "EnzoSystems",
      "location": "Almere",
      "sectors": ["Hospitality"],
      "start": "200606",
      "end": "201012",
      "description": "Developed and maintained software applications for in-house developed self-service kiosks. We also developed a remote kiosk management system, custom Windows desktop shell and certified unmanned payment system, all using Qt/C++.",
      "keywords": ["Windows","C","C++","Qt4","HTML","CSS","JS","Windows Embedded","SVN","Soap","SQLite"]
    },
    {
      "title": "Full Stack Developer",
      "company": "Yes-co",
      "location": "Almere",
      "sectors": ["Real Estate","SaaS"],
      "start": "200504",
      "end": "200606",
      "description": "Developed applications for in-house developed Saas based CRM for the real estate industry, built using PHP5 and HTML/CSS/JS.",
      "keywords": ["PHP5","HTML","CSS","JS","Soap","PostgreSQL"]
    },
    {
      "title": "Full Stack Developer",
      "company": "St. Antonius Ziekenhuis",
      "location": "Utrecht",
      "sectors": ["Healthcare"],
      "start": "200204",
      "end": "200504",
      "description": "Co-responsible for design, development and maintenance of the hospital’s web-based patient information system, built using C++, Java and HTML/CSS/JS.",
      "keywords": ["C++","Java","JS","HTML","CSS","Soap","CVS","MySQL"]
    },
    {
      "title": "Software Developer",
      "company": "Enzo Interactive Media",
      "location": "Almere",
      "sectors": ["Retail"],
      "start": "200001",
      "end": "200203",
      "description": "Responsible for design, development and maintenance of applications running on touchscreen based Windows computers, built using C/C++.",
      "keywords": ["C","C++","COM","ActiveX"]
    },
    {
      "title": "Software Developer",
      "company": "KSI Interactive",
      "location": "Almere",
      "sectors": ["Retail"],
      "start": "199801",
      "end": "199912",
      "description": "Responsible for design, development and maintenance of applications running on touchscreen based Windows computers, built using C/C++.",
      "keywords": ["C","C++","COM","ActiveX","JS","HTML","CSS","SQL Server"]
    }
  ]
}
